Revit 2027 API
FlowDirectionType Enumeration
 An enumerated type listing direction types for a connector.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum FlowDirectionType
Public Enumeration FlowDirectionType
public enum class FlowDirectionType
type FlowDirectionType
Members
Member name | Value | Description
Bidirectional | 0 |  Flow bidirectional
In | 1 |  Flow in
Out | 2 |  Flow out
See Also
Reference
Autodesk.Revit.DB Namespace